Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་མདོར་བསྡུས་པའི་གདམས་ངག་འདིས་བདག་ལ་གཏམས་ལགས་པས་གྲོ་བཞིན་སྐྱེས་གནས་པའི་ཡུལ་གྱི་མཐར་མཆིས་པར་འཚལ་ལགས་སོ།
en: “Honored One, since the Blessed One has entrusted me with this condensed instruction, I would like to go to Śroṇāparāntaka.”

source: །གང་པོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་ཡུལ་གྱི་མཐའི་མི་རྣམས་ནི་གཏུམ་པ། གཟུ་ལུམས་ཅན། རྩུབ་པ། གཤེ་བ། སྤྲོ་ཐུང་བ། འཕྱ་བ་ཡིན་ཏེ།
en: “Pūrṇa, the people of Śroṇāparāntaka are fierce, impetuous, rough, abusive, short tempered, and disparaging.

source: གང་པོ་གལ་ཏེ་ཁྱོད་ལ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་མངོན་སུམ་དུ། སྡིག་པ་ཚོགས་པར་མི་དབྱུང་བའི་ཚིག་རྩུབ་པོས་གཤེ་བར་བྱེད། ཞེར་འདེབས་པར་བྱེད། འཕྱ་བར་བྱེད་ན། དེ་ལ་ཁྱོད་ཇི་སྙམ་བྱེད།
en: Pūrṇa, if the people of Śroṇāparāntaka directly abuse, ridicule, and disparage you with bad, coarse, and intolerable words, what will you think?”

source: བཙུན་པ་གལ་ཏེ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་བདག་ལ་མངོན་སུམ་དུ་སྡིག་པ་ཚོགས་པར་མི་དབྱུང་བའི་ཚིག་རྩུབ་པོས་གཤེ་བར་བགྱིད། ཞེར་འདེབས་པར་བགྱིད། འཕྱ་བར་བགྱིད་ན་དེ་ལ་བདག་གིས་འདི་སྙམ་དུ་སེམས་ཏེ། ཨེ་མའོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ནི་རུང་བ་དག་ཡིན་ནོ།
en: “Honored One, if the people of Śroṇāparāntaka directly abuse, ridicule, and disparage me with bad, coarse, and intolerable words, I will think, ‘Ah, the people of Śroṇāparāntaka are proper.

source: །ཨེ་མའོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ནི་བློ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Ah, the people of Śroṇāparāntaka are intelligent.

source: དེ་དག་བདག་ལ་སྡིག་པ་ཚོགས་པར་མི་དབྱུང་བའི་ཚིག་རྩུབ་པོས་གཤེ་བར་བྱེད། ཞེར་འདེབས་པར་བྱེད། འཕྱ་བར་བྱེད་ཀྱང་ལག་པའམ་བོང་པས་མ་བརྒྱབ་སྙམ་མོ།
en: Although they abuse, ridicule, and disparage me with bad, coarse, and intolerable words, they do not strike me with their hands or with clods of dirt.’ ”

source: །གང་པོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ནི་གཏུམ་པ་ཞེས་བྱ་བ་ནས་འཕྱ་བར་བྱེད་པ་ཡིན་ནོ། །ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ཏེ།
en: “Pūrṇa, the people of Śroṇāparāntaka are fierce . . . and disparaging. Pūrṇa, if the people of Śroṇāparāntaka strike you with their hands or with clods of dirt, what will you think?” “Honored One, if the people of Śroṇāparāntaka strike me with their hands or with clods of dirt, I will think, ‘Ah, the people of Śroṇāparāntaka are proper.

source: གང་པོ་གལ་ཏེ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ཀྱིས་དབྱུག་པའམ་མཚོན་གྱིས་བརྒྱབ་ན་དེ་ལ་ཁྱོད་ཇི་སྙམ་བྱེད།
en: Ah, the people of Śroṇāparāntaka are intelligent. Although they strike me with their hands or with clods of dirt, they do not strike me with sticks or swords.’ ” “Pūrṇa, the people of Śroṇāparāntaka are fierce . . . and disparaging. Pūrṇa, if the people of Śroṇāparāntaka strike you with sticks or with swords, what will you think?”

source: བཙུན་པ་གལ་ཏེ་བདག་ལ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ཀྱིས་དབྱུག་པའམ་མཚོན་གྱིས་བརྒྱབ་པར་གྱུར་ན། དེ་ལ་བདག་གིས་འདི་སྙམ་སེམས་ཏེ། ཀྱེ་མའོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ནི་རུང་བ་དག་ཡིན་ནོ།
en: “Honored One, if the people of Śroṇāparāntaka strike me with sticks or with swords, I will think, ‘Ah, the people of Śroṇāparāntaka are proper.

source: །ཀྱེ་མའོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ནི་བློ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Ah, the people of Śroṇāparāntaka are intelligent.

source: དེ་དག་བདག་ལ་དབྱུག་པའམ་མཚོན་གྱིས་བརྒྱབ་ཀྱང་ཐམས་ཅད་ཀྱིས་ཐམས་ཅད་དུ་སྲོག་དང་བྲལ་བར་མི་བྱེད་དོ་སྙམ་མོ།
en: Although they strike me with sticks or with swords, they do not take my life.’ ”

source: །གང་པོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ནི་གཏུམ་པ་ཞེས་བྱ་བ་ནས་འཕྱ་བར་བྱེད་པ་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་དུ་སྟེ།
en: “Pūrṇa, the people of Śroṇāparāntaka are fierce . . . and disparaging.

source: གལ་ཏེ་གང་པོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ཀྱིས་ཁྱོད་ཐམས་ཅད་ཀྱིས་ཐམས་ཅད་དུ་སྲོག་དང་འབྲལ་བར་བྱེད་ན་དེ་ལ་ཁྱོད་ཇི་སྙམ་བྱེད། བཙུན་པ་གལ་ཏེ་བདག་ལ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ཀྱིས་ཐམས་ཅད་ཀྱིས་ཐམས་ཅད་དུ་སྲོག་དང་འབྲལ་བར་བགྱིད་ན།
en: Pūrṇa, if the people of Śroṇāparāntaka attempt to take your life, what will you think?”

source: དེ་ལ་བདག་ཉིད་འདི་སྙམ་དུ་སེམས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཉན་ཐོས་ལུས་རྣག་ཅན་འདིས། སྐྱེ་བ་དང་། ངོ་ཚ་བ་དང་། རྣམ་པར་སྨོད་པ་གང་དག་མཚོན་གྱིས་ཀྱང་འདེབས་པར་བྱེད། དུག་ཀྱང་ཟ་བར་བྱེད། ཐག་པས་ཀྱང་འགེགས་ཏེ་འཆི་བར་བྱེད། གཡངས་ནས་ཀྱང་མཆོངས་ཏེ་འཆི་བ་ཡོད་ན།
en: “Honored One, if the people of Śroṇāparāntaka attempt to take my life, I will think, ‘Among the Blessed One’s disciples there are those who, because of this purulent body, are grieved and ashamed and self-loathing, and who cut themselves with swords, ingest poison, hang themselves, or throw themselves from a cliff to their deaths. Therefore, ah, the people of Śroṇāparāntaka are proper.

source: །ཀྱེ་མའོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ནི་རུང་བ་དག་ཡིན་ནོ། །ཀྱེ་མའོ་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའི་མི་རྣམས་ནི་བློ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Ah, the people of Śroṇāparāntaka are intelligent.

source: དེ་དག་བདག་གི་ལུས་རྣག་ཅན་འདི་ལས་ཚེགས་ཆུང་ངུས་གྲོལ་བར་བྱེད་དོ་སྙམ་བསམ་པར་བགྱིའོ།
en: They liberate me from this purulent body with little trouble.’ ”

source: །གང་པོ་ལེགས་སོ་ལེགས་སོ།
en: “Good, good, Pūrṇa!

source: །གང་པོ་ཁྱོད་བཟོད་པ་དང་ངེས་པ་འདི་དང་ལྡན་པར་གྲོ་བཞིན་སྐྱེས་གནས་པའི་ཡུལ་གྱི་མཐའ་གནས་པར་ནུས་པ་ནི་ཁྱོད་ཡང་ལེགས་སོ།
en: Pūrṇa, it is good that you who possess such patience and gentleness are able to dwell in Śroṇāparāntaka.

source: །གང་པོ་སོང་ལ་མ་བསྒྲལ་བ་རྣམས་ནི་སྒྲོལ་ཅིག །མ་གྲོལ་བ་རྣམས་ནི་ཁྲོལ་ཅིག །དབུགས་མ་ཕྱིན་པ་རྣམས་ནི་དབུགས་ཕྱུང་ཤིག །ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ནི་ཡོངས་སུ་མྱ་ངན་ལས་ཟློས་ཤིག །དེ་ནས་ཚེ་དང་ལྡན་པ་གང་པོས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རངས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Pūrṇa, go and liberate those who have not been liberated. Release those who have not been released. Relieve those who have not been relieved. Emancipate those who have not been emancipated.” The venerable Pūrṇa praised and rejoiced in the words of the Blessed One. The venerable Pūrṇa then bowed low until his forehead touched the Blessed One’s feet, and he departed from the Blessed One’s presence.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ཉིད་ཀྱི་མཚན་མོ་འདས་ནས་སྔ་དྲོ་ཤམ་ཐབས་བགོས་ཏེ་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ནས་མཉན་ཡོད་དུ་བསོད་སྙོམས་ལ་ཞུགས་ཏེ།
en: After that night had passed, early in the morning the venerable Pūrṇa dressed, took his bowl and his robe, and entered Śrāvastī for alms.

source: མཉན་ཡོད་དུ་བསོད་སྙོམས་ཀྱི་ཟས་ཀྱི་བྱ་བ་བྱས་ནས་ཟས་ཕྱི་མའི་བསོད་སྙོམས་ལས་སླར་ལོག་སྟེ།
en: He took a meal of almsfood in Śrāvastī and returned after the meal.

source: གནས་མལ་ཇི་ལྟར་ལོངས་སྤྱད་པ་མཁོས་སུ་ཕབ་ནས། ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ།
en: He put in order the bedding and the seat he had used, took his bowl and his robe, and set out for Śroṇāparāntaka.

source: གྲོ་བཞིན་སྐྱེས་གནས་པས་ཡུལ་གྱི་མཐའ་གང་ན་བ་དེར་ཆས་ཏེ།
en: Traveling through the country, he arrived in due course at Śroṇāparāntaka.

source: རིམ་གྱིས་རྒྱུ་ཞིང་སོང་བ་ན་གྲོ་བཞིན་སྐྱེས་གནས་པའི་ཡུལ་གྱི་མཐར་ཕྱིན་ཏོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་གང་པོ་སྔ་དྲོ་ཤམ་ཐབས་བགོས་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ།
en: Then, early in the morning the venerable Pūrṇa dressed, took his bowl and his robe, and entered Śroṇāparāntaka for alms.

source: གྲོ་བཞིན་སྐྱེས་གནས་པས་མཐར་བསོད་སྙོམས་ལ་ཞུགས་པ་རྔོན་པ་ཞིག་མདའ་གཞུ་ལག་ན་ཐོགས་ཏེ་རི་དགས་གཤོར་དུ་འགྲོ་བ་དེས་མཐོང་ནས་དེས་བསམས་པ། དགེ་སྦྱོང་མགོ་རེག་འདི་མཐོང་བ་ནི་ཁ་རྗེ་མ་རུང་བར་བྱས་སོ་སྙམ་དུ་བསམས་ནས་གཞུ་རྣ་དྲུང་དུ་བཀང་སྟེ།
en: A hunter, carrying his bow and arrows and going to hunt deer, saw Pūrṇa and thought, “It is inauspicious that I saw this shaven-headed śramaṇa.”

source: ཚེ་དང་ལྡན་པ་གང་པོ་གང་ན་བ་དེར་བརྒྱུགས་པ་དང་། དེ་ནས་ཚེ་དང་ལྡན་པ་གང་པོས་དེ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བླ་གོས་བསྙིལ་ཏེ་སྨྲས་པ།
en: When the hunter, his bow drawn, charged at the venerable Pūrṇa, the venerable Pūrṇa caught sight of him. Upon seeing him, Pūrṇa removed his upper robe and said, “Shoot this, sir, since I entered this place for the sake of this that is hard to fill up,” and then he spoke this verse:

source: །བཞིན་བཟངས་དགང་དཀའ་བ་འདིའི་དོན་དུ་ཞུགས་པས་འདི་ལ་སྣུན་ཅིག །ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Quick, shoot an arrow into this stomach with its many ills,

source: གང་གི་དོན་དུ་མཁའ་ལ་བྱ་རྒྱུ་རི་དགས་རྙིས་ཟིན་གྱུར།
en: For the sake of which birds wander in the sky, beasts are ensnared,

source: །གཡུལ་ངོར་མདའ་མདུང་མདའ་བོ་ཆེ་ཐོགས་མི་རྣམས་འཆི་འགྱུར་ལ།
en: People wielding arrows, spears, and lances are killed in battle,

source: །བཀྲེན་པ་ཉོན་མོངས་ཡུལ་ངན་རྒྱུ་ཞིང་མཆིལ་པས་ཉ་ཟིན་པ། །སྡིག་པ་རབ་མང་ལྟོ་འདིར་ཁྱོད་ཀྱིས་འཚམ་རིམས་མདའ་འཕོངས་ཤིག །
en: And fish, swimming around from hunger, affliction, and deprivation, are caught with fishhooks.”

source: དེས་བསམས་པ། རབ་ཏུ་བྱུང་བ་འདི་ནི་འདི་ལྟ་བུའི་བཟོད་པ་དང་དེས་པ་དང་ལྡན་པ་ཡིན་ན།
en: The hunter thought, “This mendicant has such patience and gentleness.

source: ཅིའི་ཕྱིར་འདི་ལ་མདའ་འཕང་སྙམ་དུ་བསམས་ནས་དེ་སེམས་མངོན་པར་དད་པར་གྱུར་ཏོ།
en: Why should I shoot him with an arrow?” When he thought thus, the hunter’s mind was filled with faith in the venerable Pūrṇa.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་གང་པོས་དེ་ལ་ཆོས་བཤད་དེ།
en: Then the venerable Pūrṇa preached the Dharma to him and established him in the refuges and the rules of training.

source: སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་བཞག་པ་དང་། དེས་རི་ཁྲོད་པ་གཞན་ལྔ་བརྒྱ་ནི་དགེ་བསྙེན་བྱས།
en: The venerable Pūrṇa also made five hundred other huntsmen lay brothers and five hundred women lay sisters.

source: ལྔ་བརྒྱ་ནི་དགེ་བསྙེན་མར་བྱས་ནས་གཙུག་ལག་ལྔ་བརྒྱ་རྩིག་ཏུ་བཅུག་སྟེ། ཁྲི་དང་། ཁྲིའུ་དང་། སྟན་ནང་ཚངས་ཅན་དང་། སྔས་ནང་ཚངས་ཅན་དང་། གོར་ཐབས་བརྒྱ་ཕྲག་དུ་མ་འབུལ་དུ་བཅུག་གོ།
en: Five hundred monastery buildings were offered to him, and hundreds of couches, stools, cushions, pillows, and square blankets were also offered.

source: །ཟླ་བ་གསུམ་པོ་དེ་འདས་པ་དང་དེས་རིག་པ་གསུམ་ལུས་ཀྱིས་མངོན་སུམ་དུ་བྱས་ནས་དགྲ་བཅོམ་པར་གྱུར་ཏེ།
en: After three months had passed, the venerable Pūrṇa actualized with his body the threefold knowledge and became an arhat.

source: ཁམས་གསུམ་གྱི་འདོད་ཆགས་དང་བྲལ་བ་ཞེས་བྱ་བ་ནས། དབང་པོ་དང་ཉེ་དབང་པོའི་ལྷ་དང་བཅས་པ་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་དང་། རྗེད་པར་བྱ་བ་དང་། མངོན་སུམ་དུ་སྨྲ་བར་བྱ་བར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: He was free from desire for the three realms; . . . and he became an object of veneration, respect, and praise for the gods including Indra and Upendra.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་ཤིང་གི་རྣ་ཆ་ཅན་གྱི་ནུ་བོ་གཉིས་ལོངས་སྤྱོད་སྲབས་ཤིང་ཡོངས་སུ་ཟད་པས་གཏུགས་པར་གྱུར་ནས་དེ་གཉིས་ཀྱིས་སྨྲས་པ། བྱུར་ལྟ་བུ་དེ་བདག་ཅག་གི་ཁྱིམ་ནས་སོང་གིས་ཚུར་ཤོག་ལྷན་ཅིག་གནས་པར་བྱའོ། །དེས་སྨྲས་པ།
en: Later, the two brothers of Dārukarṇin, having consumed and exhausted their possessions, came to Dārukarṇin and said, “Since that creature who was our misfortune has left our home, come, let us live together.”

source: བྱུར་ལྟ་བུ་དེ་གང་ཞིག་ཡིན།
en: “Who is that creature that you say was our misfortune?” asked Dārukarṇin.

source: གང་པོ་ཡིན་མོད།
en: “Pūrṇa, of course.”

source: དེ་ནི་ཁོ་བོའི་ཁྱིམ་ནས་དཔལ་བྱུང་བ་ཡིན་གྱི་བྱུར་ལྟ་བུ་ནི་མ་ཡིན་ནོ།
en: “He is not a creature who brings misfortune; rather, he brought good fortune to my home.”

source: །དེ་གཉིས་ཀྱིས་སྨྲས་པ། དཔལ་ཡང་རུང་བྱུར་ཡང་རུང་ཚུར་ཤོག་ལྷན་ཅིག་ཏུ་གནས་པར་བྱའོ།
en: Dārukarṇin’s two brothers said, “Whether good fortune or misfortune, come, let us live together.”

source: །དེས་སྨྲས་པ། ཁྱེད་ཅག་གི་ནོར་ནི་རིགས་པར་བསྒྲུབས་པ་མ་ཡིན་ལ།
en: “Your wealth was not gained properly while mine was gained properly,” replied Dārukarṇin.

source: ཁོ་བོའི་ནི་རིགས་པར་བསྒྲུབས་པ་ཡིན་པས་ཁྱེད་ཅག་དང་ཁོ་བོར་ལྷན་ཅིག་གནས་པར་མི་བྱའོ། །དེ་གཉིས་ཀྱིས་སྨྲས་པ།
en: “Because of this difference, we cannot live together.”

source: བྲན་མོའི་བུ་དེས་རྒྱ་མཚོ་ཆེན་པོར་ཡང་སོང་ཡང་སོང་ནས་ཁྱོད་ཀྱི་ལོངས་སྤྱོད་དག་བསྒྲུབས་པས་ཁྱོད་དེ་ལ་སྤྱོད་པས་རྒྱགས་སུ་ཟད།
en: “The son of a slave woman took to the great ocean many times and helped you gain your possessions, which you spend and boast about.

source: ཁྱོད་ཀྱིས་ནི་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པར་ག་ལ་ནུས།
en: How were you able to take to the great ocean?” asked Dārukarṇin’s two brothers.

source: དེ་དེ་གཉིས་ལས་ང་རྒྱལ་བཟུང་ནས་དེས་བསམས་པ། བདག་ཀྱང་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པར་བྱའོ་སྙམ་ནས་ཞེས་བྱ་བ་ནས་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Dārukarṇin, his pride hurt by his two brothers, thought, “I will take to the great ocean, too.” Having thought this . . . Dārukarṇin took to the great ocean.

source: །ཇི་ཙམ་ན་གྲུ་བོ་ཆེ་དེ་རྗེས་སུ་མཐུན་པའི་རླུང་གིས་ཙན་དན་ས་མཆོག་གི་ཚལ་དུ་བདས་སོ།
en: His ship was driven by a tail wind to a forest of gośīrṣacandana.

source: །ས་མཁན་གྱིས་སྨྲས་པ།
en: The guide said, “Sirs, this is the forest of gośīrṣacandana.

source: ཤེས་ལྡན་དག་ཙན་དན་ས་མཆོག་གི་ཚལ་ཞེས་གྲགས་པ་གང་ཡིན་པ་དེ་ནི་འདི་ཡིན་གྱིས་འདི་ལས་འདོམས་ལ་ལོང་ཤིག །དེའི་ཚེ་ན་ཙན་དན་ས་མཆོག་གི་ཚལ་གྱི་དབང་པོ་གནོད་སྦྱིན་དབང་ཕྱུག་ཆེན་པོ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: So, choose and take wood from here.” At that time, there was a yakṣa named Maheśvara, who was master of the forest of gośīrṣacandana, and he was away at a meeting of yakṣas.

source: དེ་ཡང་གནོད་སྦྱིན་རྣམས་ཀྱི་གནོད་སྦྱིན་གྱི་མདུན་སར་སོང་ངོ་། །དེ་ནས་ཙན་དན་ས་མཆོག་གི་ཚལ་སྟ་རེ་ལྔ་བརྒྱ་ཙམ་གྱིས་བཅད་པར་བརྩམས་སོ།
en: The merchants began to cut down the gośīrṣacandana trees with five hundred axes.

source: །གནོད་སྦྱིན་མི་དགའ་བ་ཞེས་བྱ་བས་ཙན་དན་ས་མཆོག་གི་ཚལ་སྟ་རེ་ལྔ་བརྒྱ་ཙམ་གྱིས་གཅོད་པར་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་གནོད་སྦྱིན་དབང་ཕྱུག་ཆེན་པོ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་གནོད་སྦྱིན་དབང་ཕྱུག་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དཔོན་པོ་མཁྱེན་པར་མཛོད་ཅིག ། ཙན་དན་ས་མཆོག་གི་ཚལ་སྟ་རེ་ལྔ་བརྒྱ་ཙམ་གྱིས་འགུམས་ན་ཁྱོད་ཀྱི་ཕྲིན་ལས་སམ་བགྱི་བ་གང་ལགས་བ་དེ་མཛོད་ཅིག །དེ་ནས་གནོད་སྦྱིན་དབང་ཕྱུག་ཆེན་པོ་གནོད་སྦྱིན་རྣམས་ཀྱི་གནོད་སྦྱིན་གྱི་འདུན་མ་བྱས་ནས་མི་བཟོད་པ་སྐྱེས་ཏེ།
en: When a yakṣa named Apriya saw the gośīrṣacandana trees being cut down with the five hundred axes, he went to the yakṣa Maheśvara and said to him, “Sir, please be informed that the forest of gośīrṣacandana is being destroyed by five hundred axes. Thus, please do your duty, or what you ought to do.”

source: རླུང་ནག་པོ་ཆེན་པོ་འཇིགས་སུ་རུང་བ་བསླངས་ནས་ཙན་དན་ས་མཆོག་གི་ཚལ་གང་ན་བ་དེར་ཆས་སོ། །ས་མཁན་གྱིས་སྨྲས་པ།
en: Then the yakṣa Maheśvara canceled the meeting of yakṣas, and, unable to bear it, caused a violent storm and set out for the forest of gośīrṣacandana. The guide said, “Sirs, merchants of the continent of Jambu, listen.

source: ཤེས་ལྡན་འཛམ་བུའི་གླིང་གི་ཚོང་པ་དག་ཉོན་ཅིག །རླུང་ནག་པོ་ཆེན་པོའི་འཇིགས་པ་ཞིག་ཡོད་དོ་ཞེས་གྲག་པ་གང་ཡིན་པ་དེ་ནི་འདི་ཡིན་གྱིས་ངོ་ལོན་སོམ་ཤིག །དེ་ནས་ཚོང་པའི་ཚོགས་དེ་རྣམས་འཇིགས་སྐྲག་ཕོངས་ཏེ་བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་སྤུ་ཟིང་ཞེས་བྱེད་ནས། ལྷ་རྣམས་ལ་གསོལ་བ་བྱེད་པར་རྩོམ་སྟེ།
en: Since this is the very thing that is known as the fear of a great storm, think of a countermeasure.” Then the merchants were frightened, terrified, dejected, and, with the hairs in every pore of their bodies standing on end, started to beg the gods for help, saying:

source: ཞི་བ་དང་ནི་ཆུ་ལྷ་ལུས་ངན་ནོར་ལྷ་སོགས།
en: “O Śiva, Varuṇa, Kubera, Vāsava, and others,

source: །ལྷ་མི་ལྟོ་འཕྱེ་གནོད་སྦྱིན་ལྷ་མི་དབང་པོ་རྣམས།
en: Gods, humans, serpents, yakṣas, masters of the asuras,

source: །བདག་ཅག་ཤིན་ཏུ་ཉམ་ཐག་འཇིགས་པར་གྱུར་ལགས་ཀྱིས།
en: Since we are utterly tormented and frightened,

source: །བསྙེངས་བྲལ་དེ་རིང་བདག་ཅག་རྣམས་ཀྱི་མགོན་མཛོད་ཅིག །མི་རྣམས་ཁ་ཅིག་བདེ་སོགས་ཁྱོད་ལ་འདུད།
en: May the fearless ones help us!” Some bow to the husband of Śacī.

source: །གཞན་དག་ཚངས་དང་ཁྱབ་འཇུག་ལྷ་ཆེན་དང་། །སར་རྟེན་ཤིང་དང་ཚལ་ལ་བརྟེན་པ་ལ།
en: Others bow to Brahmā, Hari, and Śaṅkara. To the deities who reside in the earth, in the trees and forest,

source: །ཤ་ཟའི་རླུང་གིས་ཟིན་པས་སྐྱབས་ཚོལ་འདུད།
en: Those who are caught in a fiendish storm bow down, hoping for their protection.

source: །ཤིང་གི་རྣ་ཆ་ཅན་སེམས་ལས་ཆུང་ངུར་འདུག་པ་དང་། ཚོང་པ་རྣམས་ཀྱིས་སྨྲས་པ།
en: Dārukarṇin stood undisturbed.

source: དེད་དཔོན་བདག་ཅག་ནི་སྡུག་བསྔལ་མི་བཟད་པ་ཉམ་ང་བར་གྱུར་ན། ཁྱོད་ཅིའི་ཕྱིར་སེམས་ལས་ཆུང་ངུར་འདུག །དེས་སྨྲས་པ།
en: The merchants asked him, “Caravan leader, why do you stand undisturbed while we are in intolerable pain and fear?”

source: ཤེས་ལྡན་དག་ཁོ་བོ་ལ་ནུ་བོས་བསྒོ་བ། ཕུ་བོ་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པ་ནི་མནོག་ཆུང་ལ་ཉེས་དམིགས་མང་སྟེ།
en: “Sirs,” replied Dārukarṇin, “my younger brother told me, ‘Brother, there is much danger and little to gain on the great ocean.

source: སྲེད་པས་ལྡོངས་པ་ཕལ་ཆེར་འཇུག་ཀྱང་སླར་འཁོར་བ་ཉུང་བས་ཁྱོད་ཀྱིས་རྣམ་པ་གང་གིས་ཀྱང་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པར་མི་བྱའོ་ཞེས་བསྒོ་བ་ལས།
en: Many people driven by desire take to it but only a few of them return. So, you should never take to the great ocean.’ I disobeyed my younger brother’s words and took to the great ocean.

source: ཁོ་བོས་དེའི་ཚིག་མ་མཉན་ཏེ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་པས་ད་ཅི་བྱར་ཡང་མེད་དོ།
en: So what can I do now?”

source: །ཁྱོད་ཀྱི་ནུ་བོ་གང་ཡིན།
en: “Who is your younger brother?”

source: གང་པོ་ཡིན་ནོ།
en: “He is Pūrṇa.”

source: །ཚོང་པའི་ཚོགས་རྣམས་ཀྱིས་སྨྲས་པ། ཤེས་ལྡན་དག་འཕགས་པ་གང་པོ་དེ་ནི་བསོད་ནམས་ཀྱི་མཐུ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་གྱིས།
en: “Sirs,” said the merchants, “the noble one Pūrṇa has the great power of merit.

source: དེ་ཉིད་ལ་བདག་ཅག་སྐྱབས་སུ་འགྲོ་བར་བྱའོ་ཞེས་དེ་ཐམས་ཅད་ཀྱིས་ཚིག་མཐུན་པར་འདི་སྐད་ཅེས་འཕགས་པ་གང་པོ་དེ་ལ་ཕྱག་འཚལ་ལོ།
en: Let us seek refuge in him.” Then they all, with one voice, exclaimed, “Homage to the noble one Pūrṇa!

source: །འཕགས་པ་གང་པོ་དེ་ལ་ཕྱག་འཚལ་ལོ། །ཕྱག་འཚལ་ལོ་ཞེས་སྨྲས་སོ།
en: Homage, homage to the noble one Pūrṇa!”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་གང་པོ་ལ་མངོན་པར་དགའ་བའི་ལྷ་གང་ཡིན་པ་དེ་དག་ཚེ་དང་ལྡན་པ་གང་པོ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ཚེ་དང་ལྡན་པ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Gods who were delighted with the venerable Pūrṇa then went to him.

source: །འཕགས་པ་ཁྱོད་ཀྱིས་གཅན་ནི་སྡུག་བསྔལ་མི་བཟད་པ་ཉམ་ང་བར་གྱུར་གྱིས་དགོངས་སུ་གསོལ།
en: When they arrived, they said to the venerable Pūrṇa, “Noble one, your elder brother feels intolerable pain and fear. Please consider rescuing him.”

source: དེས་བསམས་ཏེ། དེ་ནས་སེམས་ཇི་ལྟར་མཉམ་པར་བཞག་ན་གྲོ་བཞིན་སྐྱེས་གནས་པའི་མཐའ་ནས་མི་སྣང་བར་གྱུར་ཏེ། རྒྱ་མཚོ་ཆེན་པོ་གྲུའི་དངོར་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་འདུག་པ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །དེ་ནས་རླུང་ནག་པོ་དེ་རི་རབ་ལ་ཕོག་སྟེ་རྡུགས་པ་བཞིན་དུ་སླར་ལོག་པར་གྱུར་ཏོ།
en: The venerable Pūrṇa considered this, and entered a meditative state by which, directing his mind, he disappeared from Śroṇāparāntaka and appeared seated with his legs crossed on the edge of the ship in the great ocean. The storm was then turned back as if it had struck Mount Sumeru and was thwarted.

source: །གནོད་སྦྱིན་དབང་ཕྱུག་ཆེན་པོས་བསམས་པ། སྔོན་ཆད་ནི་རླུང་ནག་པོས་གྲུ་གང་ལ་རེག་པ་དེ་ཤིང་བལ་གྱི་འདའ་བུ་བཞིན་འཕངས་པ་དང་འཇིག་པར་འགྱུར་ན་ད་རླུང་ནག་པོ་དེ་རི་རབ་ལ་ཕོག་སྟེ།
en: The yakṣa Maheśvara thought, “Though, in the past, ships that were hit by a storm were tossed like a piece of cotton and broken apart, now the storm has been turned back as if it had struck Mount Sumeru and was thwarted.

source: རྡུགས་པ་བཞིན་དུ་སླར་ལོག་པར་གྱུར་པའི་རྒྱུ་གང་ཡིན་སྙམ་ནས།
en: What was the cause of that?”

source: ཕན་ཚུན་དུ་བརྟག་པར་བརྩམས་པ་ལས། ཇི་ཙམ་ན་ཚེ་དང་ལྡན་པ་གང་པོ་གྲུའི་དངོར་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་འདུག་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེས་སྨྲས་པ། འཕགས་པ་གང་པོ་ཐོ་བཙམས་ཏེ་ཅི་བགྱི།
en: The yakṣa Maheśvara looked around and then discovered the venerable Pūrṇa seated with his legs crossed on the edge of the ship. When the yakṣa Maheśvara had discovered the venerable Pūrṇa, he asked, “Noble one Pūrṇa, why do you harass me?”

source: གང་པོས་སྨྲས་པ། རྒ་བའི་ཆོས་ཅན་ཁྱོད་ཉིད་ཀྱིས་ང་ལ་ཐོ་འཚམ་མམ།
en: “O you whose nature is to grow old, why do I harass you?” asked the venerable Pūrṇa in return.

source: གལ་ཏེ་ངས་འདི་ལྟ་བུའི་ཡོན་ཏན་གྱི་ཚོགས་མ་ཐོབ་པར་གྱུར་ན། ཁྱོད་ཀྱིས་ངའི་ཕུ་བོ་མིང་ལུས་པར་བྱས་པར་འགྱུར་རོ།
en: “You are harassing me. Had I not attained a number of good qualities like these, you would have killed my brother, and only his name would have remained.”

source: །དབང་ཕྱུག་ཆེན་པོས་སྨྲས་པ། འཕགས་པ་ཙན་དན་ས་མཆོག་འདི་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་དོན་དུ་སྲུང་ལགས་སོ། །གང་པོས་སྨྲས་པ།
en: “Noble one,” replied Maheśvara, “I am protecting this gośīrṣacandana for the wheel-turning king.”

source: དཔོན་པོ་ཇི་སྙམ་དུ་སེམས།
en: “Sir, what do you think?” asked the venerable Pūrṇa.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གང་ཆེ།
en: “Which is greater, a tathāgata, an arhat, a perfectly awakened one, or a wheel-turning king?”

source: འཕགས་པ་ཅི་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངམ། བྱུང་ངོ་།
en: “Noble one, has the Blessed One appeared in the world?” “He has.”

source: །གལ་ཏེ་དེ་ལྟ་ན་ད་གང་མ་གང་བ་དེ་ཁོང་ཤིག །དེ་ནས་ཚོང་པའི་ཚོགས་དེ་རྣམས་སྲོག་བྱིན་ཏེ།
en: “If so, then fill your ship that is not yet full.” Their lives having been saved, the minds of the merchants were then filled with faith in Pūrṇa.

source: ཚེ་དང་ལྡན་པ་གང་པོ་ལ་སེམས་མངོན་པར་དད་ནས་གྲུ་དེ་ཙན་དན་ས་མཆོག་གིས་བཀང་སྟེ་ཆས་པ་དང་རིམ་གྱིས་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུར་ཕྱིན་ཏོ།
en: They filled the ship with gośīrṣacandana, set out again, and arrived in due course at the city of Sūrpāraka.

source: །དེ་ནས་གང་པོས་ཕུ་བོ་ལ་སྨྲས་པ། གང་གི་མིང་གིས་གྲུ་བོ་ཆེ་གྲུབ་སྟེ་འོངས་པ་དེ་ནི་དེ་དབང་བས་ཁྱོད་ཀྱིས་རིན་པོ་ཆེ་ནི་ཚོང་པ་འདི་རྣམས་ལ་གོས་ཤིག །བདག་གིས་ནི་ཙན་དན་ས་མཆོག་འདི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ཙན་དན་གྱི་ཕྲེང་བའི་ཁང་བཟངས་བརྩིག་གོ།
en: Pūrṇa then said to his brother, “Since your treasures belong to the one by whose name you, having succeeded on your voyage, were able to return, you should distribute them to these merchants. With this gośīrṣacandana, I will build a palace garlanded with sandalwood for the Blessed One.”

source: །དེས་ཚོང་པ་དེ་རྣམས་ལ་རིན་པོ་ཆེ་རྣམས་བགོས་སོ།
en: Dārukarṇin distributed his treasures to the merchants.

source: །དེ་ནས་གང་པོས་ཙན་དན་ས་མཆོག་གི་ཁང་བཟངས་ཞིག་བརྩིག་པར་བརྩམས་ཏེ།
en: The venerable Pūrṇa then began to build a palace with a hall of gośīrṣacandana.

source: དེས་བཟོ་བོ་དག་བཀུག་ནས་སྨྲས་པ། ཤེས་ལྡན་དག་ཅི་ཉི་མ་རེ་རེ་ཞིང་ཀཱར་ཥཱ་པ་ཎ་ལྔ་བརྒྱ་ལེན་ནམ་འོན་ཏེ་ཙན་དན་ས་མཆོག་གི་ཕྱེ་མ་ཕོ་སུམ་གང་ལེན། དེ་དག་གིས་སྨྲས་པ།
en: He called the craftsmen together and asked them, “Sirs, would you like to take five hundred kārṣāpaṇas every day or take one viḍālapada of gośīrṣacandana dust?”

source: འཕགས་པ་ཙན་དན་ས་མཆོག་གི་ཕྱེ་མ་ཕོ་སུམ་གང་འཚལ་ལོ།
en: “Noble one,” they replied, “we would like to take one viḍālapada of gośīrṣacandana dust.”

source: །ཇི་ཙམ་ན་རིང་པོ་མ་ཐོགས་པར་ཙན་དན་གྱི་ཕྲེང་བའི་ཁང་བཟངས་བརྩིགས་ཏེ་བྱི་དོར་ཐམས་ཅད་ཟིན་པར་གྱུར་ཏོ།
en: The palace garlanded with sandalwood was then quickly built and made clean.

source: །དེ་ན་ཞོགས་མ་དང་ཕྱེ་མའི་ལྷག་མ་གང་ཡིན་པ་དེ་དག་ཀྱང་བཏགས་ནས་དེ་ཉིད་ལ་ཞལ་ཞལ་དུ་བྱུགས་སོ།
en: The wood chips and remaining dust of gośīrṣacandana were crushed into powder and smeared on the palace walls.

source: །དེས་སྤུན་དེ་རྣམས་ཕན་ཚུན་དུ་ཐམས་ཅད་བཟོད་པ་གསོལ་དུ་བཅུག་ནས་སྨྲས་པ།
en: Pūrṇa reconciled with his eldest brother and his other two brothers and said, “Invite the community of monks headed by the Buddha and offer a meal.”

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་སྤྱན་དྲངས་ལ་ཞལ་ཟས་གསོལ་ཅིག །འཕགས་པ་གང་པོ་བཅོམ་ལྡན་འདས་གང་ན་བཞུགས།
en: “Noble one Pūrṇa, where is the Blessed One?”

source: མཉན་ཡོད་ནའོ།
en: “In Śrāvastī.”

source: །ལམ་ཇི་སྲིད་མཆིས།
en: “How far is that?”

source: མཉན་ཡོད་ན་དཔག་ཚད་བརྒྱ་ལྷག་ཙམ་མོ།
en: “To Śrāvastī, it is more than one hundred yojanas.”

source: །རེ་ཞིག་རྒྱལ་པོ་ལ་བརྟག་པར་བགྱིའོ།
en: “We will ask His Majesty for permission.”

source: །དེ་བཞིན་དུ་གྱིས་ཤིག །དེ་དག་རྒྱལ་པོའི་དྲུང་དུ་དོང་ནས་ལྷ་བདག་ཅག་ནི་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་ཏེ་ཞལ་ཟས་གསོལ་བར་འཚལ་ན།
en: “You should do so.” The brothers went to the king and said, “Your Majesty, we would like to invite the community of monks headed by the Buddha and offer a meal.

source: ལྷས་བདག་ཅག་ལ་བསྟང་དུ་གསོལ།
en: Please help us.”

source: རུང་གིས་དེ་བཞིན་དུ་བྱའོ།
en: “Excellent, I will do so.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་གང་པོ་ཁང་སྟེང་དུ་འཛེགས་ནས་རྒྱལ་བྱེད་ཀྱི་ཚལ་ལོགས་སུ་ཁ་བལྟས་ཏེ། པུས་མོ་ལྷ་ང་གཉིས་ས་ལ་བཙུགས་ཏེ་འདུག་ནས་མེ་ཏོག་གིས་གཏོར། བདུག་པས་བདུགས་ནས་ཁྱིམ་པ་ཞིག་གསེར་གྱི་བྱ་མ་བུམ་འཛིན་དུ་བཅུག་སྟེ་གསོལ་བ་འདེབས་པ་ལ་ཞུགས་པ།
en: The venerable Pūrṇa then went up to the roof, looked in the direction of the Jetavana, dropped to his knees, scattered flowers, burned incense, made a layman hold a golden pitcher, and began to pray:

source: ཚུལ་ཁྲིམས་རྣམ་དག་ཤིན་ཏུ་རྣམ་དག་བློ།
en: “O you of pure conduct, one with greatly pure intellect,

source: །ཞལ་ཟས་དུས་སུ་རྟག་ཏུ་དོན་གཟིགས་པ།
en: One who always seeks to benefit at mealtimes,
